Repository: CofficLab/Lumi
Catalog: Plugins/MessageRendererPlugin/Sources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: Allow
zh_hans: 允许
zh_hk: 允許

source: Completed
zh_hans: 已完成
zh_hk: 已完成

source: Copy
zh_hans: 复制
zh_hk: 複製

source: Core Message Renderer
zh_hans: 核心消息渲染器
zh_hk: 核心消息渲染器

source: Deny
zh_hans: 拒绝
zh_hk: 拒絕

source: Failed
zh_hans: 失败
zh_hk: 失敗

source: Output: %lld lines, %@
zh_hans: 输出：%lld 行，%@
zh_hk: 輸出：%lld 行，%@

source: Provides built-in message type rendering support
zh_hans: 提供内置消息类型的渲染支持
zh_hk: 提供內置消息類型的渲染支持

source: Running
zh_hans: 进行中
zh_hk: 進行中

source: Show Less
zh_hans: 收起
zh_hk: 收起

source: Show More
zh_hans: 展开
zh_hk: 展開

source: Stop Current Turn
zh_hans: 停止本轮
zh_hk: 停止本輪

source: Stopped
zh_hans: 已停止
zh_hk: 已停止

source: Stopping…
zh_hans: 停止中…
zh_hk: 停止中…

source: Thinking
zh_hans: 思考中
zh_hk: 思考中

source: Tool
zh_hans: 工具
zh_hk: 工具

source: Tool permission required
zh_hans: 需要工具授权
zh_hk: 需要工具授權

source: 工具执行
zh_hk: 工具執行

source: 工具执行失败
zh_hk: 工具执行失敗

source: 思考过程
zh_hk: 思考過程

# 提供内置消息类型的渲染支持
source: Built-in message type rendering support
zh_hans: 提供内置消息类型的渲染支持
zh_hk: 提供內建訊息類型的渲染支援

source: 查询结果中…
zh_hk: 查詢結果中…

# 核心消息渲染器
source: Core Message Renderer
zh_hans: 核心消息渲染器
zh_hk: 核心訊息渲染器

source: 点击结果后会在这里显示工具输出
zh_hk: 點擊結果後會在這裡顯示工具輸出

# 重发
source: Resend
zh_hans: 重发
zh_hk: 重發

# 重新发送该消息
source: Resend this message
zh_hans: 重新发送该消息
zh_hk: 重新發送該訊息

source: Received Data
zh_hans: 收到的数据

source: Request / Response Details
zh_hans: 请求与响应详情

source: Request failed.
zh_hans: 请求失败。

source: Sending Data
zh_hans: 发送的数据

source: Show request and response details
zh_hans: 查看请求与响应详情
